snlkuharlocal/src/Documents/НачислениеПремииЗаВыполнениеПлана/НачислениеПремииЗаВыполнениеПлана.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>НачислениеПремииЗаВыполнениеПлана</name>
  <registerRecords>AccumulationRegister.ПремииСотрудников</registerRecords>
  <attributes>
    <name>МесяцНачисления</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидНачисления</name>
    <type>
      <types>CatalogRef.РаспределениеСотрудниковПоНаправлениямПродаж</types>
    </type>
  </attributes>
  <attributes>
    <name>ПланРассчитан</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ФактРассчитан</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПремияРассчитана</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВсегоНачислено</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>17</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВсегоПлан</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>17</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВсегоФакт</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>17</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>РасчетПоМенеджеру</name>
    <attributes>
      <name>Менеджер</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>КритерийНачисления</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>План</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>17</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Факт</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>17</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПроцентВыполнения</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>17</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>МаксимальноОплачиваемыйПроцентВыполнения</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПремияПриВыполненииСтаПроцентовПлана</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>17</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Начислено</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>17</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидНачисленияПремии</name>
      <type>
        <types>EnumRef.ВидыНачисленияПремий</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

snlkuharlocal/src/Enums/ВидыНачисленияПремий/ВидыНачисленияПремий.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыНачисленияПремий</name>
  <enumValues>
    <name>ПремияЗаВыполнениеПлана</name>
  </enumValues>
  <enumValues>
    <name>МинимальнаяПремия</name>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/Documents/НачислениеПремииЗаВыполнениеПлана/ManagerModule.bsl
#Область ПрограммныйИнтерфейс

// Рассчитывает минимальную премию за месяц для направлений продаж, где начисленная сумма меньше минимальной суммы премии.
//
// Параметры:
//   МесяцРасчетов - Дата - месяц, за который производится расчет
Процедура РассчитатьМинимальнуюПремиюЗаМесяц(МесяцРасчетов) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("МесяцРасчетов", МесяцРасчетов);
	Запрос.Текст = "ВЫБРАТЬ
	|	Док.Ссылка.ВидНачисления.НаправлениеПродаж КАК Направление,
	|	МАКСИМУМ(Док.Ссылка.ВидНачисления.НаправлениеПродаж.МинимальнаяСуммаПремии) КАК МинимальнаяСуммаПремии,
	|	СУММА(Док.Начислено) КАК Начислено
	|ПОМЕСТИТЬ НаправленияСМинимальнойПремией
	|ИЗ
	|	Документ.НачислениеПремииЗаВыполнениеПлана.РасчетПоМенеджеру КАК Док
	|ГДЕ
	|	Док.Ссылка.Проведен
	|	И Док.Ссылка.МесяцНачисления = &МесяцРасчетов
	|
	|СГРУППИРОВАТЬ ПО
	|	Док.Ссылка.ВидНачисления.НаправлениеПродаж
	|
	|ИМЕЮЩИЕ
	|	СУММА(Док.Начислено) < МАКСИМУМ(Док.Ссылка.ВидНачисления.НаправлениеПродаж.МинимальнаяСуммаПремии)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НаправленияСМинимальнойПремией.Направление КАК Направление,
	|	Док.Ссылка КАК Документ,
	|	Док.НомерСтроки КАК КоличествоСтрок,
	|	НаправленияСМинимальнойПремией.МинимальнаяСуммаПремии КАК МинимальнаяСуммаПремии
	|ИЗ
	|	НаправленияСМинимальнойПремией КАК НаправленияСМинимальнойПремией
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.НачислениеПремииЗаВыполнениеПлана.РасчетПоМенеджеру КАК Док
	|		ПО НаправленияСМинимальнойПремией.Направление = Док.Ссылка.ВидНачисления.НаправлениеПродаж
	|			И (Док.Ссылка.Проведен)
	|			И (Док.Ссылка.МесяцНачисления = &МесяцРасчетов)
	|ИТОГИ
	|	КОЛИЧЕСТВО(КоличествоСтрок),
	|	МАКСИМУМ(МинимальнаяСуммаПремии)
	|ПО
	|	Направление,
	|	Документ";
	
	ВыборкаНаправления = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "Направление");
	Пока ВыборкаНаправления.Следующий() Цикл
		РассчитатьМинимальнуюПремиюПоНаправлению(ВыборкаНаправления);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции
Процедура РассчитатьМинимальнуюПремиюПоНаправлению(ВыборкаНаправления)
	
	НачатьТранзакцию();
	
	ДокОбъект = Неопределено;
	ОсталосьРаспределить = 0;
	МинимальнаяСуммаПремии = ВыборкаНаправления.МинимальнаяСуммаПремии;
	ОбщееКоличествоСтрок = ВыборкаНаправления.КоличествоСтрок;
	Если ОбщееКоличествоСтрок = 0 Или ОбщееКоличествоСтрок = Null Тогда
		Возврат;
	КонецЕсли;
	СуммаНаСтроку = Окр(МинимальнаяСуммаПремии / ОбщееКоличествоСтрок, 2);
	ОсталосьРаспределить = МинимальнаяСуммаПремии;
	
	ВыборкаДокументы = ВыборкаНаправления.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "Документ");
	Пока ВыборкаДокументы.Следующий() Цикл
		ДокОбъект = ВыборкаДокументы.Документ.ПолучитьОбъект();
		Для Каждого СтрТЧ Из ДокОбъект.РасчетПоМенеджеру Цикл
			СтрТЧ.ВидНачисленияПремии = Перечисления.ВидыНачисленияПремий.МинимальнаяПремия;
			СтрТЧ.Начислено = Мин(ОсталосьРаспределить, СуммаНаСтроку);
			ОсталосьРаспределить = ОсталосьРаспределить - СтрТЧ.Начислено;
			ОсталосьРаспределить = Макс(ОсталосьРаспределить, 0);
		КонецЦикла;
		Попытка
			ДокОбъект.Записать(РежимЗаписиДокумента.Проведение);
		Исключение
			ОтменитьТранзакцию();
			ТекстСообщения = "Не удалось рассчитать минимальную премию " + ОписаниеОшибки();
			ВызватьИсключение ТекстСообщения;
		КонецПопытки;		
	КонецЦикла;
	Если ОсталосьРаспределить > 0 И ДокОбъект <> Неопределено Тогда
		ДокОбъект.РасчетПоМенеджеру[0].Начислено = ДокОбъект.РасчетПоМенеджеру[0].Начислено + ОсталосьРаспределить;
		Попытка
			ДокОбъект.Записать(РежимЗаписиДокумента.Проведение);
		Исключение
			ОтменитьТранзакцию();
			ТекстСообщения = "Не удалось рассчитать минимальную премию " + ОписаниеОшибки();
			ВызватьИсключение ТекстСообщения;
		КонецПопытки;
	КонецЕсли;
	
	ЗафиксироватьТранзакцию();
	
КонецПроцедуры

#КонецОбласти
